src/exps/fio_benchmarks/paperexps/R-512G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=1315: Thu Sep 27 16:56:12 2018
  write: IOPS=1021, BW=4084KiB/s (4182kB/s)(718MiB/180036msec)
    clat (usec): min=76, max=285724, avg=975.65, stdev=9475.45
     lat (usec): min=76, max=285725, avg=976.06, stdev=9475.47
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[   101], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   110],
     | 70.00th=[   112], 80.00th=[   116], 90.00th=[   143], 95.00th=[   157],
     | 99.00th=[ 23200], 99.50th=[ 33162], 99.90th=[156238], 99.95th=[166724],
     | 99.99th=[233833]
   bw (  KiB/s): min=   12, max=11145, per=78.78%, avg=3217.43, stdev=4024.12, samples=359
   iops        : min=    3, max= 2786, avg=804.00, stdev=1006.04, samples=359
  lat (usec)   : 100=4.53%, 250=91.94%, 500=1.04%, 750=0.91%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.06%, 20=0.03%, 50=1.02%
  lat (msec)   : 100=0.05%, 250=0.41%, 500=0.01%
  cpu          : usr=0.47%, sys=1.40%, ctx=183823, majf=0, minf=30
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,183819,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=1629: Thu Sep 27 16:56:12 2018
  write: IOPS=15, BW=63.0KiB/s (65.5kB/s)(18.8MiB/300125msec)
    clat (usec): min=95, max=217484, avg=62505.35, stdev=62960.96
     lat (usec): min=96, max=217485, avg=62506.01, stdev=62961.14
    clat percentiles (usec):
     |  1.00th=[   105],  5.00th=[   109], 10.00th=[   110], 20.00th=[   112],
     | 30.00th=[   114], 40.00th=[   137], 50.00th=[ 74974], 60.00th=[101188],
     | 70.00th=[109577], 80.00th=[123208], 90.00th=[149947], 95.00th=[160433],
     | 99.00th=[175113], 99.50th=[179307], 99.90th=[187696], 99.95th=[198181],
     | 99.99th=[217056]
   bw (  KiB/s): min=   24, max=  624, per=100.00%, avg=64.03, stdev=104.24, samples=600
   iops        : min=    6, max=  156, avg=16.00, stdev=26.04, samples=600
  lat (usec)   : 100=0.19%, 250=45.66%, 500=0.29%
  lat (msec)   : 2=0.46%, 4=0.33%, 10=0.81%, 20=0.12%, 50=0.31%
  lat (msec)   : 100=9.23%, 250=42.60%
  cpu          : usr=0.01%, sys=0.05%, ctx=4801, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,4801,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4084KiB/s (4182kB/s), 4084KiB/s-4084KiB/s (4182kB/s-4182kB/s), io=718MiB (753MB), run=180036-180036msec

Run status group 1 (all jobs):
  WRITE: bw=63.0KiB/s (65.5kB/s), 63.0KiB/s-63.0KiB/s (65.5kB/s-65.5kB/s), io=18.8MiB (19.7MB), run=300125-300125msec

Disk stats (read/write):
  sdc: ios=119/188619, merge=0/0, ticks=45/476606, in_queue=476597, util=99.22%