src/exps/fio_benchmarks/paperexps/R-512M.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=22216: Thu Sep 27 14:46:19 2018
  write: IOPS=2573, BW=10.1MiB/s (10.5MB/s)(1810MiB/180010msec)
    clat (usec): min=78, max=285979, avg=384.65, stdev=3047.46
     lat (usec): min=79, max=285979, avg=385.10, stdev=3047.46
    clat percentiles (usec):
     |  1.00th=[   98],  5.00th=[  104], 10.00th=[  108], 20.00th=[  111],
     | 30.00th=[  113], 40.00th=[  115], 50.00th=[  116], 60.00th=[  118],
     | 70.00th=[  120], 80.00th=[  123], 90.00th=[  151], 95.00th=[  161],
     | 99.00th=[20841], 99.50th=[22676], 99.90th=[32113], 99.95th=[32375],
     | 99.99th=[33817]
   bw (  KiB/s): min= 3968, max=13170, per=98.06%, avg=10094.98, stdev=1310.21, samples=360
   iops        : min=  992, max= 3292, avg=2523.41, stdev=327.54, samples=360
  lat (usec)   : 100=1.68%, 250=95.28%, 500=1.14%, 750=0.82%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.04%, 20=0.03%, 50=1.00%
  lat (msec)   : 100=0.01%, 500=0.01%
  cpu          : usr=1.24%, sys=3.76%, ctx=463330, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,463316,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=22477: Thu Sep 27 14:46:19 2018
  write: IOPS=2533, BW=9.90MiB/s (10.4MB/s)(2969MiB/300004msec)
    clat (usec): min=69, max=285510, avg=390.30, stdev=3088.82
     lat (usec): min=69, max=285511, avg=390.89, stdev=3088.83
    clat percentiles (usec):
     |  1.00th=[  100],  5.00th=[  105], 10.00th=[  110], 20.00th=[  113],
     | 30.00th=[  115], 40.00th=[  116], 50.00th=[  117], 60.00th=[  119],
     | 70.00th=[  121], 80.00th=[  124], 90.00th=[  151], 95.00th=[  163],
     | 99.00th=[20055], 99.50th=[22414], 99.90th=[32113], 99.95th=[32637],
     | 99.99th=[36439]
   bw (  KiB/s): min= 3024, max=13368, per=100.00%, avg=10157.20, stdev=1408.33, samples=600
   iops        : min=  756, max= 3342, avg=2539.21, stdev=352.08, samples=600
  lat (usec)   : 100=1.21%, 250=95.74%, 500=1.17%, 750=0.79%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.05%, 20=0.04%, 50=1.00%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=1.24%, sys=4.23%, ctx=760136, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,760108,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=10.1MiB/s (10.5MB/s), 10.1MiB/s-10.1MiB/s (10.5MB/s-10.5MB/s), io=1810MiB (1898MB), run=180010-180010msec

Run status group 1 (all jobs):
  WRITE: bw=9.90MiB/s (10.4MB/s), 9.90MiB/s-9.90MiB/s (10.4MB/s-10.4MB/s), io=2969MiB (3113MB), run=300004-300004msec

Disk stats (read/write):
  sdc: ios=113/1223327, merge=0/0, ticks=1832/452421, in_queue=453560, util=94.15%