src/exps/fio_benchmarks/paperexps/R-64G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=27799: Thu Sep 27 15:48:49 2018
  write: IOPS=1060, BW=4242KiB/s (4344kB/s)(746MiB/180037msec)
    clat (usec): min=78, max=285717, avg=939.10, stdev=8703.04
     lat (usec): min=78, max=285718, avg=939.55, stdev=8703.07
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[   101], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   110],
     | 70.00th=[   112], 80.00th=[   116], 90.00th=[   143], 95.00th=[   165],
     | 99.00th=[ 23200], 99.50th=[ 62129], 99.90th=[139461], 99.95th=[158335],
     | 99.99th=[181404]
   bw (  KiB/s): min=   18, max=10819, per=78.44%, avg=3326.65, stdev=3936.60, samples=359
   iops        : min=    4, max= 2704, avg=831.30, stdev=984.13, samples=359
  lat (usec)   : 100=4.44%, 250=92.01%, 500=1.01%, 750=0.87%, 1000=0.01%
  lat (msec)   : 2=0.04%, 4=0.01%, 10=0.11%, 20=0.03%, 50=0.98%
  lat (msec)   : 100=0.10%, 250=0.40%, 500=0.01%
  cpu          : usr=0.47%, sys=1.53%, ctx=190928, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,190924,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=28058: Thu Sep 27 15:48:49 2018
  write: IOPS=83, BW=333KiB/s (341kB/s)(97.6MiB/300004msec)
    clat (usec): min=77, max=1084.2k, avg=12001.50, stdev=37974.04
     lat (usec): min=78, max=1084.2k, avg=12002.00, stdev=37974.15
    clat percentiles (usec):
     |  1.00th=[    100],  5.00th=[    105], 10.00th=[    106],
     | 20.00th=[    108], 30.00th=[    110], 40.00th=[    111],
     | 50.00th=[    112], 60.00th=[    114], 70.00th=[    118],
     | 80.00th=[    147], 90.00th=[  62129], 95.00th=[ 105382],
     | 99.00th=[ 158335], 99.50th=[ 166724], 99.90th=[ 181404],
     | 99.95th=[ 187696], 99.99th=[1002439]
   bw (  KiB/s): min=    8, max=  760, per=100.00%, avg=336.11, stdev=335.98, samples=595
   iops        : min=    2, max=  190, avg=84.00, stdev=83.97, samples=595
  lat (usec)   : 100=1.01%, 250=86.13%, 500=0.11%, 750=0.13%, 1000=0.08%
  lat (msec)   : 2=0.85%, 4=0.01%, 10=1.19%, 20=0.07%, 50=0.15%
  lat (msec)   : 100=2.29%, 250=7.95%, 500=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=0.04%, sys=0.18%, ctx=24989, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,24987,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4242KiB/s (4344kB/s), 4242KiB/s-4242KiB/s (4344kB/s-4344kB/s), io=746MiB (782MB), run=180037-180037msec

Run status group 1 (all jobs):
  WRITE: bw=333KiB/s (341kB/s), 333KiB/s-333KiB/s (341kB/s-341kB/s), io=97.6MiB (102MB), run=300004-300004msec

Disk stats (read/write):
  sdc: ios=120/215910, merge=0/0, ticks=703/475935, in_queue=476541, util=99.11%