src/exps/fio_benchmarks/paperexps/R-8G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=25137: Thu Sep 27 15:19:07 2018
  write: IOPS=1061, BW=4247KiB/s (4349kB/s)(747MiB/180047msec)
    clat (usec): min=79, max=842355, avg=937.82, stdev=11439.84
     lat (usec): min=79, max=842356, avg=938.26, stdev=11439.86
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[   101], 10.00th=[   104], 20.00th=[   106],
     | 30.00th=[   108], 40.00th=[   109], 50.00th=[   110], 60.00th=[   112],
     | 70.00th=[   114], 80.00th=[   122], 90.00th=[   147], 95.00th=[   178],
     | 99.00th=[ 22938], 99.50th=[ 23987], 99.90th=[109577], 99.95th=[141558],
     | 99.99th=[641729]
   bw (  KiB/s): min=    6, max=11110, per=81.21%, avg=3449.12, stdev=3878.19, samples=348
   iops        : min=    1, max= 2777, avg=861.89, stdev=969.52, samples=348
  lat (usec)   : 100=4.65%, 250=91.81%, 500=1.06%, 750=0.82%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.15%, 20=0.06%, 50=0.96%
  lat (msec)   : 100=0.09%, 250=0.34%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.48%, sys=1.58%, ctx=191191, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,191183,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=25393: Thu Sep 27 15:19:07 2018
  write: IOPS=121, BW=487KiB/s (499kB/s)(143MiB/300099msec)
    clat (usec): min=78, max=1043.4k, avg=8207.62, stdev=42615.26
     lat (usec): min=79, max=1043.4k, avg=8208.10, stdev=42615.32
    clat percentiles (usec):
     |  1.00th=[    97],  5.00th=[   104], 10.00th=[   106], 20.00th=[   109],
     | 30.00th=[   110], 40.00th=[   112], 50.00th=[   113], 60.00th=[   115],
     | 70.00th=[   120], 80.00th=[   145], 90.00th=[   221], 95.00th=[100140],
     | 99.00th=[111674], 99.50th=[162530], 99.90th=[750781], 99.95th=[767558],
     | 99.99th=[876610]
   bw (  KiB/s): min=    7, max= 4144, per=100.00%, avg=513.03, stdev=768.41, samples=571
   iops        : min=    1, max= 1036, avg=128.22, stdev=192.08, samples=571
  lat (usec)   : 100=2.01%, 250=88.47%, 500=0.68%, 750=0.15%, 1000=0.04%
  lat (msec)   : 2=0.28%, 4=0.36%, 10=1.21%, 20=0.54%, 50=0.24%
  lat (msec)   : 100=1.05%, 250=4.69%, 500=0.07%, 750=0.07%, 1000=0.13%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.07%, sys=0.24%, ctx=36545, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,36543,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4247KiB/s (4349kB/s), 4247KiB/s-4247KiB/s (4349kB/s-4349kB/s), io=747MiB (783MB), run=180047-180047msec

Run status group 1 (all jobs):
  WRITE: bw=487KiB/s (499kB/s), 487KiB/s-487KiB/s (499kB/s-499kB/s), io=143MiB (150MB), run=300099-300099msec

Disk stats (read/write):
  sdc: ios=120/227725, merge=0/0, ticks=3057/475577, in_queue=478533, util=99.04%